<?php
/**
 * Copyright © Magento, Inc. All rights reserved.
 * See COPYING.txt for license details.
 */

namespace Healthyvibes\Directory\Setup\Patch\Data;

use Healthyvibes\Directory\Setup\RegionCityZipcodeDataInstaller;
use Healthyvibes\Directory\Setup\RegionCityZipcodeDataInstallerFactory;
use Magento\Framework\Setup\ModuleDataSetupInterface;
use Magento\Framework\Setup\Patch\DataPatchInterface;

/**
 * Patch is mechanism, that allows to do atomic upgrade data changes
 */
class UpdateMappingCityAndWard implements DataPatchInterface
{

    /**
     * @var ModuleDataSetupInterface
     */
    private $moduleDataSetup;
    /**
     * @var RegionCityZipcodeDataInstallerFactory
     */
    private $regionCityZipcodeDataInstallerFactory;

    /**
     * AddNewDataForVietnam constructor.
     * @param ModuleDataSetupInterface $moduleDataSetup
     * @param RegionCityZipcodeDataInstallerFactory $regionCityZipcodeDataInstallerFactory
     */
    public function __construct(
        ModuleDataSetupInterface $moduleDataSetup,
        RegionCityZipcodeDataInstallerFactory $regionCityZipcodeDataInstallerFactory
    ) {
        $this->moduleDataSetup = $moduleDataSetup;
        $this->regionCityZipcodeDataInstallerFactory = $regionCityZipcodeDataInstallerFactory;
    }

    /**
     * Do Upgrade
     *
     * @return void
     */
    public function apply()
    {
        $this->moduleDataSetup->startSetup();
        /** @var RegionCityZipcodeDataInstaller $regionCityDataInstaller */
        $regionCityDataInstaller = $this->regionCityZipcodeDataInstallerFactory->create();
        $regionCityDataInstaller->updateCityCode($this->moduleDataSetup->getConnection(), $this->getDataMapping());
        $this->moduleDataSetup->endSetup();
    }

    /**
     * {@inheritdoc}
     */
    public function getAliases()
    {
        return [];
    }

    /**
     * {@inheritdoc}
     */
    public static function getDependencies()
    {
        return [AddNewCityData::class];
    }

    /**
     * @return array[]
     */
    public function getDataMapping()
    {
        return
            [
                0 => [
                        0 => '1890',
                        1 => 'Huyện Bảo Lâm',
                        2 => '21000',
                    ],
                1 => [
                        0 => '1566',
                        1 => 'Thành phố Long Xuyên',
                        2 => '90000',
                    ],
                2 => [
                        0 => '1753',
                        1 => 'Thành phố Châu Đốc',
                        2 => '90000',
                    ],
                3 => [
                        0 => '1754',
                        1 => 'Huyện An Phú',
                        2 => '90000',
                    ],
                4 => [
                        0 => '1755',
                        1 => 'Thị Xã Tân Châu',
                        2 => '90000',
                    ],
                5 => [
                        0 => '1756',
                        1 => 'Huyện Phú Tân',
                        2 => '90000',
                    ],
                6 => [
                        0 => '1758',
                        1 => 'Huyện Châu Phú',
                        2 => '90000',
                    ],
                7 => [
                        0 => '1752',
                        1 => 'Huyện Tịnh Biên',
                        2 => '90000',
                    ],
                8 => [
                        0 => '1751',
                        1 => 'Huyện Tri Tôn',
                        2 => '90000',
                    ],
                9 => [
                        0 => '1718',
                        1 => 'Huyện Châu Thành',
                        2 => '90000',
                    ],
                10 => [
                        0 => '1757',
                        1 => 'Huyện Chợ Mới',
                        2 => '90000',
                    ],
                11 => [
                        0 => '1750',
                        1 => 'Huyện Thoại Sơn',
                        2 => '90000',
                    ],
                12 => [
                        0 => '1544',
                        1 => 'Thành phố Vũng Tàu',
                        2 => '78000',
                    ],
                13 => [
                        0 => '1667',
                        1 => 'Thành phố Bà Rịa',
                        2 => '78000',
                    ],
                14 => [
                        0 => '1709',
                        1 => 'Huyện Châu Đức',
                        2 => '78000',
                    ],
                15 => [
                        0 => '1699',
                        1 => 'Huyện Xuyên Mộc',
                        2 => '78000',
                    ],
                16 => [
                        0 => '1689',
                        1 => 'Huyện Long Điền',
                        2 => '78000',
                    ],
                17 => [
                        0 => '1690',
                        1 => 'Huyện Đất Đỏ',
                        2 => '78000',
                    ],
                18 => [
                        0 => '1701',
                        1 => 'Thị Xã Phú Mỹ',
                        2 => '78000',
                    ],
                19 => [
                        0 => '1643',
                        1 => 'Thành phố Bắc Giang',
                        2 => '26000',
                    ],
                20 => [
                        0 => '1765',
                        1 => 'Huyện Yên Thế',
                        2 => '26000',
                    ],
                21 => [
                        0 => '1762',
                        1 => 'Huyện Tân Yên',
                        2 => '26000',
                    ],
                22 => [
                        0 => '1760',
                        1 => 'Huyện Lạng Giang',
                        2 => '26000',
                    ],
                23 => [
                        0 => '1965',
                        1 => 'Huyện Lục Nam',
                        2 => '26000',
                    ],
                24 => [
                        0 => '1966',
                        1 => 'Huyện Lục Ngạn',
                        2 => '26000',
                    ],
                25 => [
                        0 => '1761',
                        1 => 'Huyện Sơn Động',
                        2 => '26000',
                    ],
                26 => [
                        0 => '1764',
                        1 => 'Huyện Yên Dũng',
                        2 => '26000',
                    ],
                27 => [
                        0 => '1763',
                        1 => 'Huyện Việt Yên',
                        2 => '26000',
                    ],
                28 => [
                        0 => '1759',
                        1 => 'Huyện Hiệp Hòa',
                        2 => '26000',
                    ],
                29 => [
                        0 => '1640',
                        1 => 'Thành phố Bắc Kạn',
                        2 => '23000',
                    ],
                30 => [
                        0 => '3249',
                        1 => 'Huyện Pác Nặm',
                        2 => '23000',
                    ],
                31 => [
                        0 => '1887',
                        1 => 'Huyện Ba Bể',
                        2 => '23000',
                    ],
                32 => [
                        0 => '3242',
                        1 => 'Huyện Ngân Sơn',
                        2 => '23000',
                    ],
                33 => [
                        0 => '1889',
                        1 => 'Huyện Bạch Thông',
                        2 => '23000',
                    ],
                34 => [
                        0 => '1913',
                        1 => 'Huyện Chợ Đồn',
                        2 => '23000',
                    ],
                35 => [
                        0 => '1914',
                        1 => 'Huyện Chợ Mới',
                        2 => '23000',
                    ],
                36 => [
                        0 => '3232',
                        1 => 'Huyện Na Rì',
                        2 => '23000',
                    ],
                37 => [
                        0 => '1655',
                        1 => 'Thành phố Bạc Liêu',
                        2 => '97000',
                    ],
                38 => [
                        0 => '1946',
                        1 => 'Huyện Hồng Dân',
                        2 => '97000',
                    ],
                39 => [
                        0 => '1998',
                        1 => 'Huyện Phước Long',
                        2 => '97000',
                    ],
                40 => [
                        0 => '2050',
                        1 => 'Huyện Vĩnh Lợi',
                        2 => '97000',
                    ],
                41 => [
                        0 => '1935',
                        1 => 'Thị Xã Giá Rai',
                        2 => '97000',
                    ],
                42 => [
                        0 => '1926',
                        1 => 'Huyện Đông Hải',
                        2 => '97000',
                    ],
                43 => [
                        0 => '1723',
                        1 => 'Huyện Hòa Bình',
                        2 => '97000',
                    ],
                44 => [
                        0 => '1644',
                        1 => 'Thành phố Bắc Ninh',
                        2 => '16000',
                    ],
                45 => [
                        0 => '1768',
                        1 => 'Huyện Yên Phong',
                        2 => '16000',
                    ],
                46 => [
                        0 => '1728',
                        1 => 'Huyện Quế Võ',
                        2 => '16000',
                    ],
                47 => [
                        0 => '1729',
                        1 => 'Huyện Tiên Du',
                        2 => '16000',
                    ],
                48 => [
                        0 => '1730',
                        1 => 'Thị xã Từ Sơn',
                        2 => '16000',
                    ],
                49 => [
                        0 => '1767',
                        1 => 'Huyện Thuận Thành',
                        2 => '16000',
                    ],
                50 => [
                        0 => '1766',
                        1 => 'Huyện Gia Bình',
                        2 => '16000',
                    ],
                51 => [
                        0 => '1969',
                        1 => 'Huyện Lương Tài',
                        2 => '16000',
                    ],
                52 => [
                        0 => '1558',
                        1 => 'Thành phố Bến Tre',
                        2 => '86000',
                    ],
                53 => [
                        0 => '1742',
                        1 => 'Huyện Châu Thành',
                        2 => '86000',
                    ],
                54 => [
                        0 => '3158',
                        1 => 'Huyện Chợ Lách',
                        2 => '86000',
                    ],
                55 => [
                        0 => '1975',
                        1 => 'Huyện Mỏ Cày Nam',
                        2 => '86000',
                    ],
                56 => [
                        0 => '1937',
                        1 => 'Huyện Giồng Trôm',
                        2 => '86000',
                    ],
                57 => [
                        0 => '1895',
                        1 => 'Huyện Bình Đại',
                        2 => '86000',
                    ],
                58 => [
                        0 => '1888',
                        1 => 'Huyện Ba Tri',
                        2 => '86000',
                    ],
                59 => [
                        0 => '2028',
                        1 => 'Huyện Thạnh Phú',
                        2 => '86000',
                    ],
                60 => [
                        0 => '1974',
                        1 => 'Huyện Mỏ Cày Bắc',
                        2 => '86000',
                    ],
                61 => [
                        0 => '1662',
                        1 => 'Thành phố Quy Nhơn',
                        2 => '55000',
                    ],
                62 => [
                        0 => '1886',
                        1 => 'Huyện An Lão',
                        2 => '55000',
                    ],
                63 => [
                        0 => '1771',
                        1 => 'Thị xã Hoài Nhơn',
                        2 => '55000',
                    ],
                64 => [
                        0 => '2140',
                        1 => 'Huyện Hoài Ân',
                        2 => '55000',
                    ],
                65 => [
                        0 => '3254',
                        1 => 'Huyện Phù Mỹ',
                        2 => '55000',
                    ],
                66 => [
                        0 => '2258',
                        1 => 'Huyện Vĩnh Thạnh',
                        2 => '55000',
                    ],
                67 => [
                        0 => '3279',
                        1 => 'Huyện Tây Sơn',
                        2 => '55000',
                    ],
                68 => [
                        0 => '1770',
                        1 => 'Huyện Phù Cát',
                        2 => '55000',
                    ],
                69 => [
                        0 => '1769',
                        1 => 'Thị xã An Nhơn',
                        2 => '55000',
                    ],
                70 => [
                        0 => '2023',
                        1 => 'Huyện Tuy Phước',
                        2 => '55000',
                    ],
                71 => [
                        0 => '3312',
                        1 => 'Huyện Vân Canh',
                        2 => '55000',
                    ],
                72 => [
                        0 => '1538',
                        1 => 'Thành phố Thủ Dầu Một',
                        2 => '75000',
                    ],
                73 => [
                        0 => '3132',
                        1 => 'Huyện Bàu Bàng',
                        2 => '75000',
                    ],
                74 => [
                        0 => '1746',
                        1 => 'Huyện Dầu Tiếng',
                        2 => '75000',
                    ],
                75 => [
                        0 => '1696',
                        1 => 'Thị xã Bến Cát',
                        2 => '75000',
                    ],
                76 => [
                        0 => '1992',
                        1 => 'Huyện Phú Giáo',
                        2 => '75000',
                    ],
                77 => [
                        0 => '1695',
                        1 => 'Thị xã Tân Uyên',
                        2 => '75000',
                    ],
                78 => [
                        0 => '1540',
                        1 => 'Thành phố Dĩ An',
                        2 => '75000',
                    ],
                79 => [
                        0 => '1541',
                        1 => 'Thành phố Thuận An',
                        2 => '75000',
                    ],
                80 => [
                        0 => '3135',
                        1 => 'Huyện Bắc Tân Uyên',
                        2 => '75000',
                    ],
                81 => [
                        0 => '1775',
                        1 => 'Thị xã Phước Long',
                        2 => '67000',
                    ],
                82 => [
                        0 => '1625',
                        1 => 'Thành phố Đồng Xoài',
                        2 => '67000',
                    ],
                83 => [
                        0 => '1774',
                        1 => 'Thị xã Bình Long',
                        2 => '67000',
                    ],
                84 => [
                        0 => '3141',
                        1 => 'Huyện Bù Gia Mập',
                        2 => '67000',
                    ],
                85 => [
                        0 => '1964',
                        1 => 'Huyện Lộc Ninh',
                        2 => '67000',
                    ],
                86 => [
                        0 => '3140',
                        1 => 'Huyện Bù Đốp',
                        2 => '67000',
                    ],
                87 => [
                        0 => '1773',
                        1 => 'Huyện Hớn Quản',
                        2 => '67000',
                    ],
                88 => [
                        0 => '1722',
                        1 => 'Huyện Đồng Phú',
                        2 => '67000',
                    ],
                89 => [
                        0 => '1899',
                        1 => 'Huyện Bù Đăng',
                        2 => '67000',
                    ],
                90 => [
                        0 => '1772',
                        1 => 'Huyện Chơn Thành',
                        2 => '67000',
                    ],
                91 => [
                        0 => '3444',
                        1 => 'Huyện Phú Riềng',
                        2 => '67000',
                    ],
                92 => [
                        0 => '1666',
                        1 => 'Thành phố Phan Thiết',
                        2 => '77000',
                    ],
                93 => [
                        0 => '1778',
                        1 => 'Thị xã La Gi',
                        2 => '77000',
                    ],
                94 => [
                        0 => '1781',
                        1 => 'Huyện Tuy Phong',
                        2 => '77000',
                    ],
                95 => [
                        0 => '1780',
                        1 => 'Huyện Bắc Bình',
                        2 => '77000',
                    ],
                96 => [
                        0 => '1777',
                        1 => 'Huyện Hàm Thuận Bắc',
                        2 => '77000',
                    ],
                97 => [
                        0 => '1776',
                        1 => 'Huyện Hàm Thuận Nam',
                        2 => '77000',
                    ],
                98 => [
                        0 => '2012',
                        1 => 'Huyện Tánh Linh',
                        2 => '77000',
                    ],
                99 => [
                        0 => '1779',
                        1 => 'Huyện Đức Linh',
                        2 => '77000',
                    ],
                100 => [
                        0 => '3196',
                        1 => 'Huyện Hàm Tân',
                        2 => '77000',
                    ],
                101 => [
                        0 => '2116',
                        1 => 'Huyện Phú Quý',
                        2 => '77000',
                    ],
                102 => [
                        0 => '1654',
                        1 => 'Thành phố Cà Mau',
                        2 => '98000',
                    ],
                103 => [
                        0 => '2042',
                        1 => 'Huyện U Minh',
                        2 => '98000',
                    ],
                104 => [
                        0 => '1782',
                        1 => 'Huyện Thới Bình',
                        2 => '98000',
                    ],
                105 => [
                        0 => '2038',
                        1 => 'Huyện Trần Văn Thời',
                        2 => '98000',
                    ],
                106 => [
                        0 => '1901',
                        1 => 'Huyện Cái Nước',
                        2 => '98000',
                    ],
                107 => [
                        0 => '1922',
                        1 => 'Huyện Đầm Dơi',
                        2 => '98000',
                    ],
                108 => [
                        0 => '1783',
                        1 => 'Huyện Năm Căn',
                        2 => '98000',
                    ],
                109 => [
                        0 => '1883',
                        1 => 'Huyện Phú Tân',
                        2 => '98000',
                    ],
                110 => [
                        0 => '2186',
                        1 => 'Huyện Ngọc Hiển',
                        2 => '98000',
                    ],
                111 => [
                        0 => '1572',
                        1 => 'Quận Ninh Kiều',
                        2 => '94000',
                    ],
                112 => [
                        0 => '1575',
                        1 => 'Quận Ô Môn',
                        2 => '94000',
                    ],
                113 => [
                        0 => '1573',
                        1 => 'Quận Bình Thủy',
                        2 => '94000',
                    ],
                114 => [
                        0 => '1574',
                        1 => 'Quận Cái Răng',
                        2 => '94000',
                    ],
                115 => [
                        0 => '1576',
                        1 => 'Quận Thốt Nốt',
                        2 => '94000',
                    ],
                116 => [
                        0 => '3317',
                        1 => 'Huyện Vĩnh Thạnh',
                        2 => '94000',
                    ],
                117 => [
                        0 => '3150',
                        1 => 'Huyện Cờ Đỏ',
                        2 => '94000',
                    ],
                118 => [
                        0 => '3250',
                        1 => 'Huyện Phong Điền',
                        2 => '94000',
                    ],
                119 => [
                        0 => '3300',
                        1 => 'Huyện Thới Lai',
                        2 => '94000',
                    ],
                120 => [
                        0 => '1641',
                        1 => 'Thành phố Cao Bằng',
                        2 => '21000',
                    ],
                121 => [
                        0 => '3130',
                        1 => 'Huyện Bảo Lạc',
                        2 => '21000',
                    ],
                122 => [
                        0 => '3299',
                        1 => 'Huyện Thông Nông',
                        2 => '21000',
                    ],
                123 => [
                        0 => '1939',
                        1 => 'Huyện Hà Quảng',
                        2 => '21000',
                    ],
                124 => [
                        0 => '3305',
                        1 => 'Huyện Trà Lĩnh',
                        2 => '21000',
                    ],
                125 => [
                        0 => '2041',
                        1 => 'Huyện Trùng Khánh',
                        2 => '21000',
                    ],
                126 => [
                        0 => '3194',
                        1 => 'Huyện Hạ Lang',
                        2 => '21000',
                    ],
                127 => [
                        0 => '3259',
                        1 => 'Huyện Quảng Uyên',
                        2 => '21000',
                    ],
                128 => [
                        0 => '1997',
                        1 => 'Huyện Phục Hòa',
                        2 => '21000',
                    ],
                129 => [
                        0 => '1943',
                        1 => 'Huyện Hòa An',
                        2 => '21000',
                    ],
                130 => [
                        0 => '3246',
                        1 => 'Huyện Nguyên Bình',
                        2 => '21000',
                    ],
                131 => [
                        0 => '3289',
                        1 => 'Huyện Thạch An',
                        2 => '21000',
                    ],
                132 => [
                        0 => '1530',
                        1 => 'Quận Liên Chiểu',
                        2 => '50000',
                    ],
                133 => [
                        0 => '1527',
                        1 => 'Quận Thanh Khê',
                        2 => '50000',
                    ],
                134 => [
                        0 => '1526',
                        1 => 'Quận Hải Châu',
                        2 => '50000',
                    ],
                135 => [
                        0 => '1528',
                        1 => 'Quận Sơn Trà',
                        2 => '50000',
                    ],
                136 => [
                        0 => '1529',
                        1 => 'Quận Ngũ Hành Sơn',
                        2 => '50000',
                    ],
                137 => [
                        0 => '1531',
                        1 => 'Quận Cẩm Lệ',
                        2 => '50000',
                    ],
                138 => [
                        0 => '1687',
                        1 => 'Huyện Hòa Vang',
                        2 => '50000',
                    ],
                139 => [
                        0 => '1552',
                        1 => 'Thành phố Buôn Ma Thuột',
                        2 => '63000',
                    ],
                140 => [
                        0 => '1788',
                        1 => 'Thị xã Buôn Hồ',
                        2 => '63000',
                    ],
                141 => [
                        0 => '1786',
                        1 => 'Huyện Ea H\'Leo',
                        2 => '63000',
                    ],
                142 => [
                        0 => '2131',
                        1 => 'Huyện Ea Súp',
                        2 => '63000',
                    ],
                143 => [
                        0 => '1784',
                        1 => 'Huyện Buôn Đôn',
                        2 => '63000',
                    ],
                144 => [
                        0 => '1785',
                        1 => 'Huyện Cư M\'Gar',
                        2 => '63000',
                    ],
                145 => [
                        0 => '2150',
                        1 => 'Huyện Krông Búk',
                        2 => '63000',
                    ],
                146 => [
                        0 => '1787',
                        1 => 'Huyện Krông Năng',
                        2 => '63000',
                    ],
                147 => [
                        0 => '1931',
                        1 => 'Huyện Ea Kar',
                        2 => '63000',
                    ],
                148 => [
                        0 => '3418',
                        1 => 'Huyện M\'Đrắk',
                        2 => '63000',
                    ],
                149 => [
                        0 => '1789',
                        1 => 'Huyện Krông Bông',
                        2 => '63000',
                    ],
                150 => [
                        0 => '1954',
                        1 => 'Huyện Krông Pắc',
                        2 => '63000',
                    ],
                151 => [
                        0 => '1884',
                        1 => 'Huyện Krông A Na',
                        2 => '63000',
                    ],
                152 => [
                        0 => '3217',
                        1 => 'Huyện Lắk',
                        2 => '63000',
                    ],
                153 => [
                        0 => '3153',
                        1 => 'Huyện Cư Kuin',
                        2 => '63000',
                    ],
                154 => [
                        0 => '1627',
                        1 => 'Thành phố Gia Nghĩa',
                        2 => '65000',
                    ],
                155 => [
                        0 => '1791',
                        1 => 'Huyện Đắk Glong',
                        2 => '65000',
                    ],
                156 => [
                        0 => '3152',
                        1 => 'Huyện Cư Jút',
                        2 => '65000',
                    ],
                157 => [
                        0 => '1792',
                        1 => 'Huyện Đắk Mil',
                        2 => '65000',
                    ],
                158 => [
                        0 => '2151',
                        1 => 'Huyện Krông Nô',
                        2 => '65000',
                    ],
                159 => [
                        0 => '2120',
                        1 => 'Huyện Đắk Song',
                        2 => '65000',
                    ],
                160 => [
                        0 => '1790',
                        1 => 'Huyện Đắk R\'Lấp',
                        2 => '65000',
                    ],
                161 => [
                        0 => '2227',
                        1 => 'Huyện Tuy Đức',
                        2 => '65000',
                    ],
                162 => [
                        0 => '1676',
                        1 => 'Thành phố Điện Biên Phủ',
                        2 => '32000',
                    ],
                163 => [
                        0 => '2060',
                        1 => 'Thị xã Mường Lay',
                        2 => '32000',
                    ],
                164 => [
                        0 => '1979',
                        1 => 'Huyện Mường Nhé',
                        2 => '32000',
                    ],
                165 => [
                        0 => '1978',
                        1 => 'Huyện Mường Chà',
                        2 => '32000',
                    ],
                166 => [
                        0 => '2021',
                        1 => 'Huyện Tủa Chùa',
                        2 => '32000',
                    ],
                167 => [
                        0 => '2022',
                        1 => 'Huyện Tuần Giáo',
                        2 => '32000',
                    ],
                168 => [
                        0 => '1923',
                        1 => 'Huyện Điện Biên',
                        2 => '32000',
                    ],
                169 => [
                        0 => '2123',
                        1 => 'Huyện Điện Biên Đông',
                        2 => '32000',
                    ],
                170 => [
                        0 => '2170',
                        1 => 'Huyện Mường Ảng',
                        2 => '32000',
                    ],
                171 => [
                        0 => '2179',
                        1 => 'Huyện Nậm Pồ',
                        2 => '32000',
                    ],
                172 => [
                        0 => '1536',
                        1 => 'Thành phố Biên Hòa',
                        2 => '76000',
                    ],
                173 => [
                        0 => '1692',
                        1 => 'Thành phố Long Khánh',
                        2 => '76000',
                    ],
                174 => [
                        0 => '1693',
                        1 => 'Huyện Tân Phú',
                        2 => '76000',
                    ],
                175 => [
                        0 => '2049',
                        1 => 'Huyện Vĩnh Cửu',
                        2 => '76000',
                    ],
                176 => [
                        0 => '1700',
                        1 => 'Huyện Định Quán',
                        2 => '76000',
                    ],
                177 => [
                        0 => '1691',
                        1 => 'Huyện Trảng Bom',
                        2 => '76000',
                    ],
                178 => [
                        0 => '1705',
                        1 => 'Huyện Thống Nhất',
                        2 => '76000',
                    ],
                179 => [
                        0 => '1702',
                        1 => 'Huyện Cẩm Mỹ',
                        2 => '76000',
                    ],
                180 => [
                        0 => '1694',
                        1 => 'Huyện Long Thành',
                        2 => '76000',
                    ],
                181 => [
                        0 => '1704',
                        1 => 'Huyện Xuân Lộc',
                        2 => '76000',
                    ],
                182 => [
                        0 => '1708',
                        1 => 'Huyện Nhơn Trạch',
                        2 => '76000',
                    ],
                183 => [
                        0 => '1564',
                        1 => 'Thành phố Cao Lãnh',
                        2 => '81000',
                    ],
                184 => [
                        0 => '1668',
                        1 => 'Thành phố Sa Đéc',
                        2 => '81000',
                    ],
                185 => [
                        0 => '2059',
                        1 => 'Thị xã Hồng Ngự',
                        2 => '81000',
                    ],
                186 => [
                        0 => '2013',
                        1 => 'Huyện Tân Hồng',
                        2 => '81000',
                    ],
                187 => [
                        0 => '3200',
                        1 => 'Thành phố Hồng Ngự',
                        2 => '81000',
                    ],
                188 => [
                        0 => '2011',
                        1 => 'Huyện Tam Nông',
                        2 => '81000',
                    ],
                189 => [
                        0 => '2030',
                        1 => 'Huyện Tháp Mười',
                        2 => '81000',
                    ],
                190 => [
                        0 => '1724',
                        1 => 'Huyện Cao Lãnh',
                        2 => '81000',
                    ],
                191 => [
                        0 => '2026',
                        1 => 'Huyện Thanh Bình',
                        2 => '81000',
                    ],
                192 => [
                        0 => '1961',
                        1 => 'Huyện Lấp Vò',
                        2 => '81000',
                    ],
                193 => [
                        0 => '1725',
                        1 => 'Huyện Lai Vung',
                        2 => '81000',
                    ],
                194 => [
                        0 => '3155',
                        1 => 'Huyện Châu Thành',
                        2 => '81000',
                    ],
                195 => [
                        0 => '1546',
                        1 => 'Thành phố Pleiku',
                        2 => '61000',
                    ],
                196 => [
                        0 => '1800',
                        1 => 'Thị xã An Khê',
                        2 => '61000',
                    ],
                197 => [
                        0 => '1798',
                        1 => 'Thị xã Ayun Pa',
                        2 => '61000',
                    ],
                198 => [
                        0 => '2144',
                        1 => 'Huyện Kbang',
                        2 => '61000',
                    ],
                199 => [
                        0 => '2118',
                        1 => 'Huyện Đắk Đoa',
                        2 => '61000',
                    ],
                200 => [
                        0 => '1801',
                        1 => 'Huyện Chư Păh',
                        2 => '61000',
                    ],
                201 => [
                        0 => '1793',
                        1 => 'Huyện Ia Grai',
                        2 => '61000',
                    ],
                202 => [
                        0 => '2165',
                        1 => 'Huyện Mang Yang',
                        2 => '61000',
                    ],
                203 => [
                        0 => '2149',
                        1 => 'Huyện Kông Chro',
                        2 => '61000',
                    ],
                204 => [
                        0 => '1794',
                        1 => 'Huyện Đức Cơ',
                        2 => '61000',
                    ],
                205 => [
                        0 => '1795',
                        1 => 'Huyện Chư Prông',
                        2 => '61000',
                    ],
                206 => [
                        0 => '1796',
                        1 => 'Huyện Chư Sê',
                        2 => '61000',
                    ],
                207 => [
                        0 => '2119',
                        1 => 'Huyện Đắk Pơ',
                        2 => '61000',
                    ],
                208 => [
                        0 => '1799',
                        1 => 'Huyện Ia Pa',
                        2 => '61000',
                    ],
                209 => [
                        0 => '2152',
                        1 => 'Huyện Krông Pa',
                        2 => '61000',
                    ],
                210 => [
                        0 => '1797',
                        1 => 'Huyện Phú Thiện',
                        2 => '61000',
                    ],
                211 => [
                        0 => '2101',
                        1 => 'Huyện Chư Pưh',
                        2 => '61000',
                    ],
                212 => [
                        0 => '1600',
                        1 => 'Thành phố Hà Giang',
                        2 => '20000',
                    ],
                213 => [
                        0 => '1928',
                        1 => 'Huyện Đồng Văn',
                        2 => '20000',
                    ],
                214 => [
                        0 => '1973',
                        1 => 'Huyện Mèo Vạc',
                        2 => '20000',
                    ],
                215 => [
                        0 => '2053',
                        1 => 'Huyện Yên Minh',
                        2 => '20000',
                    ],
                216 => [
                        0 => '1999',
                        1 => 'Huyện Quản Bạ',
                        2 => '20000',
                    ],
                217 => [
                        0 => '2256',
                        1 => 'Huyện Vị Xuyên',
                        2 => '20000',
                    ],
                218 => [
                        0 => '2075',
                        1 => 'Huyện Bắc Mê',
                        2 => '20000',
                    ],
                219 => [
                        0 => '1945',
                        1 => 'Huyện Hoàng Su Phì',
                        2 => '20000',
                    ],
                220 => [
                        0 => '2052',
                        1 => 'Huyện Xín Mần',
                        2 => '20000',
                    ],
                221 => [
                        0 => '1893',
                        1 => 'Huyện Bắc Quang',
                        2 => '20000',
                    ],
                222 => [
                        0 => '2001',
                        1 => 'Huyện Quang Bình',
                        2 => '20000',
                    ],
                223 => [
                        0 => '1614',
                        1 => 'Thành phố Phủ Lý',
                        2 => '18000',
                    ],
                224 => [
                        0 => '1802',
                        1 => 'Thị xã Duy Tiên',
                        2 => '18000',
                    ],
                225 => [
                        0 => '1952',
                        1 => 'Huyện Kim Bảng',
                        2 => '18000',
                    ],
                226 => [
                        0 => '2027',
                        1 => 'Huyện Thanh Liêm',
                        2 => '18000',
                    ],
                227 => [
                        0 => '1897',
                        1 => 'Huyện Bình Lục',
                        2 => '18000',
                    ],
                228 => [
                        0 => '1970',
                        1 => 'Huyện Lý Nhân',
                        2 => '18000',
                    ],
                229 => [
                        0 => '1484',
                        1 => 'Quận Ba Đình',
                        2 => '10000',
                    ],
                230 => [
                        0 => '1489',
                        1 => 'Quận Hoàn Kiếm',
                        2 => '10000',
                    ],
                231 => [
                        0 => '1492',
                        1 => 'Quận Tây Hồ',
                        2 => '10000',
                    ],
                232 => [
                        0 => '1491',
                        1 => 'Quận Long Biên',
                        2 => '10000',
                    ],
                233 => [
                        0 => '1485',
                        1 => 'Quận Cầu Giấy',
                        2 => '10000',
                    ],
                234 => [
                        0 => '1486',
                        1 => 'Quận Đống Đa',
                        2 => '10000',
                    ],
                235 => [
                        0 => '1488',
                        1 => 'Quận Hai Bà Trưng',
                        2 => '10000',
                    ],
                236 => [
                        0 => '1490',
                        1 => 'Quận Hoàng Mai',
                        2 => '10000',
                    ],
                237 => [
                        0 => '1493',
                        1 => 'Quận Thanh Xuân',
                        2 => '10000',
                    ],
                238 => [
                        0 => '1583',
                        1 => 'Huyện Sóc Sơn',
                        2 => '10000',
                    ],
                239 => [
                        0 => '1582',
                        1 => 'Huyện Đông Anh',
                        2 => '10000',
                    ],
                240 => [
                        0 => '1703',
                        1 => 'Huyện Gia Lâm',
                        2 => '10000',
                    ],
                241 => [
                        0 => '3440',
                        1 => 'Quận Nam Từ Liêm',
                        2 => '10000',
                    ],
                242 => [
                        0 => '1710',
                        1 => 'Huyện Thanh Trì',
                        2 => '10000',
                    ],
                243 => [
                        0 => '1482',
                        1 => 'Quận Bắc Từ Liêm',
                        2 => '10000',
                    ],
                244 => [
                        0 => '1581',
                        1 => 'Huyện Mê Linh',
                        2 => '10000',
                    ],
                245 => [
                        0 => '1542',
                        1 => 'Quận Hà Đông',
                        2 => '10000',
                    ],
                246 => [
                        0 => '1711',
                        1 => 'Thị xã Sơn Tây',
                        2 => '10000',
                    ],
                247 => [
                        0 => '1803',
                        1 => 'Huyện Ba Vì',
                        2 => '10000',
                    ],
                248 => [
                        0 => '1807',
                        1 => 'Huyện Phúc Thọ',
                        2 => '10000',
                    ],
                249 => [
                        0 => '1804',
                        1 => 'Huyện Đan Phượng',
                        2 => '10000',
                    ],
                250 => [
                        0 => '1805',
                        1 => 'Huyện Hoài Đức',
                        2 => '10000',
                    ],
                251 => [
                        0 => '2004',
                        1 => 'Huyện Quốc Oai',
                        2 => '10000',
                    ],
                252 => [
                        0 => '1808',
                        1 => 'Huyện Thạch Thất',
                        2 => '10000',
                    ],
                253 => [
                        0 => '1915',
                        1 => 'Huyện Chương Mỹ',
                        2 => '10000',
                    ],
                254 => [
                        0 => '1809',
                        1 => 'Huyện Thanh Oai',
                        2 => '10000',
                    ],
                255 => [
                        0 => '3303',
                        1 => 'Huyện Thường Tín',
                        2 => '10000',
                    ],
                256 => [
                        0 => '3255',
                        1 => 'Huyện Phú Xuyên',
                        2 => '10000',
                    ],
                257 => [
                        0 => '1810',
                        1 => 'Huyện Ứng Hòa',
                        2 => '10000',
                    ],
                258 => [
                        0 => '1806',
                        1 => 'Huyện Mỹ Đức',
                        2 => '10000',
                    ],
                259 => [
                        0 => '1618',
                        1 => 'Thành phố Hà Tĩnh',
                        2 => '45000',
                    ],
                260 => [
                        0 => '1814',
                        1 => 'Thị xã Hồng Lĩnh',
                        2 => '45000',
                    ],
                261 => [
                        0 => '3201',
                        1 => 'Huyện Hương Sơn',
                        2 => '45000',
                    ],
                262 => [
                        0 => '3188',
                        1 => 'Huyện Đức Thọ',
                        2 => '45000',
                    ],
                263 => [
                        0 => '3320',
                        1 => 'Huyện Vũ Quang',
                        2 => '45000',
                    ],
                264 => [
                        0 => '1813',
                        1 => 'Huyện Nghi Xuân',
                        2 => '45000',
                    ],
                265 => [
                        0 => '3143',
                        1 => 'Huyện Can Lộc',
                        2 => '45000',
                    ],
                266 => [
                        0 => '1812',
                        1 => 'Huyện Hương Khê',
                        2 => '45000',
                    ],
                267 => [
                        0 => '2024',
                        1 => 'Huyện Thạch Hà',
                        2 => '45000',
                    ],
                268 => [
                        0 => '1815',
                        1 => 'Huyện Cẩm Xuyên',
                        2 => '45000',
                    ],
                269 => [
                        0 => '1811',
                        1 => 'Huyện Kỳ Anh',
                        2 => '45000',
                    ],
                270 => [
                        0 => '3220',
                        1 => 'Huyện Lộc Hà',
                        2 => '45000',
                    ],
                271 => [
                        0 => '3441',
                        1 => 'Thị xã Kỳ Anh',
                        2 => '45000',
                    ],
                272 => [
                        0 => '1598',
                        1 => 'Thành phố Hải Dương',
                        2 => '3000',
                    ],
                273 => [
                        0 => '2056',
                        1 => 'Thành phố Chí Linh',
                        2 => '3000',
                    ],
                274 => [
                        0 => '1727',
                        1 => 'Huyện Nam Sách',
                        2 => '3000',
                    ],
                275 => [
                        0 => '1818',
                        1 => 'Thị xã Kinh Môn',
                        2 => '3000',
                    ],
                276 => [
                        0 => '1953',
                        1 => 'Huyện Kim Thành',
                        2 => '3000',
                    ],
                277 => [
                        0 => '3292',
                        1 => 'Huyện Thanh Hà',
                        2 => '3000',
                    ],
                278 => [
                        0 => '1817',
                        1 => 'Huyện Cẩm Giàng',
                        2 => '3000',
                    ],
                279 => [
                        0 => '1816',
                        1 => 'Huyện Bình Giang',
                        2 => '3000',
                    ],
                280 => [
                        0 => '1934',
                        1 => 'Huyện Gia Lộc',
                        2 => '3000',
                    ],
                281 => [
                        0 => '3287',
                        1 => 'Huyện Tứ Kỳ',
                        2 => '3000',
                    ],
                282 => [
                        0 => '3238',
                        1 => 'Huyện Ninh Giang',
                        2 => '3000',
                    ],
                283 => [
                        0 => '3294',
                        1 => 'Huyện Thanh Miện',
                        2 => '3000',
                    ],
                284 => [
                        0 => '1589',
                        1 => 'Quận Hồng Bàng',
                        2 => '4000',
                    ],
                285 => [
                        0 => '1587',
                        1 => 'Quận Ngô Quyền',
                        2 => '4000',
                    ],
                286 => [
                        0 => '1588',
                        1 => 'Quận Lê Chân',
                        2 => '4000',
                    ],
                287 => [
                        0 => '1591',
                        1 => 'Quận Hải An',
                        2 => '4000',
                    ],
                288 => [
                        0 => '1590',
                        1 => 'Quận Kiến An',
                        2 => '4000',
                    ],
                289 => [
                        0 => '1707',
                        1 => 'Quận Đồ Sơn',
                        2 => '4000',
                    ],
                290 => [
                        0 => '1706',
                        1 => 'Quận Dương Kinh',
                        2 => '4000',
                    ],
                291 => [
                        0 => '1726',
                        1 => 'Huyện Thủy Nguyên',
                        2 => '4000',
                    ],
                292 => [
                        0 => '1819',
                        1 => 'Huyện An Dương',
                        2 => '4000',
                    ],
                293 => [
                        0 => '1820',
                        1 => 'Huyện An Lão',
                        2 => '4000',
                    ],
                294 => [
                        0 => '3203',
                        1 => 'Huyện Kiến Thụy',
                        2 => '4000',
                    ],
                295 => [
                        0 => '1821',
                        1 => 'Huyện Tiên Lãng',
                        2 => '4000',
                    ],
                296 => [
                        0 => '1822',
                        1 => 'Huyện Vĩnh Bảo',
                        2 => '4000',
                    ],
                297 => [
                        0 => '2108',
                        1 => 'Huyện Cát Hải',
                        2 => '4000',
                    ],
                298 => [
                        0 => '1653',
                        1 => 'Thành phố Vị Thanh',
                        2 => '95000',
                    ],
                299 => [
                        0 => '1823',
                        1 => 'Thành phố Ngã Bảy',
                        2 => '95000',
                    ],
                300 => [
                        0 => '1912',
                        1 => 'Huyện Châu Thành A',
                        2 => '95000',
                    ],
                301 => [
                        0 => '2096',
                        1 => 'Huyện Châu Thành',
                        2 => '95000',
                    ],
                302 => [
                        0 => '1824',
                        1 => 'Huyện Phụng Hiệp',
                        2 => '95000',
                    ],
                303 => [
                        0 => '2048',
                        1 => 'Huyện Vị Thuỷ',
                        2 => '95000',
                    ],
                304 => [
                        0 => '3445',
                        1 => 'Huyện Long Mỹ',
                        2 => '95000',
                    ],
                305 => [
                        0 => '3218',
                        1 => 'Thị xã Long Mỹ',
                        2 => '95000',
                    ],
                306 => [
                        0 => '1442',
                        1 => 'Quận 1',
                        2 => '70000',
                    ],
                307 => [
                        0 => '1454',
                        1 => 'Quận 12',
                        2 => '70000',
                    ],
                308 => [
                        0 => '1463',
                        1 => 'Quận Thủ Đức',
                        2 => '70000',
                    ],
                309 => [
                        0 => '1451',
                        1 => 'Quận 9',
                        2 => '70000',
                    ],
                310 => [
                        0 => '1461',
                        1 => 'Quận Gò Vấp',
                        2 => '70000',
                    ],
                311 => [
                        0 => '1462',
                        1 => 'Quận Bình Thạnh',
                        2 => '70000',
                    ],
                312 => [
                        0 => '1455',
                        1 => 'Quận Tân Bình',
                        2 => '70000',
                    ],
                313 => [
                        0 => '1456',
                        1 => 'Quận Tân Phú',
                        2 => '70000',
                    ],
                314 => [
                        0 => '1457',
                        1 => 'Quận Phú Nhuận',
                        2 => '70000',
                    ],
                315 => [
                        0 => '1443',
                        1 => 'Quận 2',
                        2 => '70000',
                    ],
                316 => [
                        0 => '1444',
                        1 => 'Quận 3',
                        2 => '70000',
                    ],
                317 => [
                        0 => '1452',
                        1 => 'Quận 10',
                        2 => '70000',
                    ],
                318 => [
                        0 => '1453',
                        1 => 'Quận 11',
                        2 => '70000',
                    ],
                319 => [
                        0 => '1446',
                        1 => 'Quận 4',
                        2 => '70000',
                    ],
                320 => [
                        0 => '1447',
                        1 => 'Quận 5',
                        2 => '70000',
                    ],
                321 => [
                        0 => '1448',
                        1 => 'Quận 6',
                        2 => '70000',
                    ],
                322 => [
                        0 => '1450',
                        1 => 'Quận 8',
                        2 => '70000',
                    ],
                323 => [
                        0 => '1458',
                        1 => 'Quận Bình Tân',
                        2 => '70000',
                    ],
                324 => [
                        0 => '1449',
                        1 => 'Quận 7',
                        2 => '70000',
                    ],
                325 => [
                        0 => '1460',
                        1 => 'Huyện Củ Chi',
                        2 => '70000',
                    ],
                326 => [
                        0 => '1459',
                        1 => 'Huyện Hóc Môn',
                        2 => '70000',
                    ],
                327 => [
                        0 => '1533',
                        1 => 'Huyện Bình Chánh',
                        2 => '70000',
                    ],
                328 => [
                        0 => '1534',
                        1 => 'Huyện Nhà Bè',
                        2 => '70000',
                    ],
                329 => [
                        0 => '2090',
                        1 => 'Huyện Cần Giờ',
                        2 => '70000',
                    ],
                330 => [
                        0 => '1678',
                        1 => 'Thành phố Hòa Bình',
                        2 => '36000',
                    ],
                331 => [
                        0 => '1916',
                        1 => 'Huyện Đà Bắc',
                        2 => '36000',
                    ],
                332 => [
                        0 => '1955',
                        1 => 'Huyện Kỳ Sơn',
                        2 => '36000',
                    ],
                333 => [
                        0 => '1968',
                        1 => 'Huyện Lương Sơn',
                        2 => '36000',
                    ],
                334 => [
                        0 => '2146',
                        1 => 'Huyện Kim Bôi',
                        2 => '36000',
                    ],
                335 => [
                        0 => '2087',
                        1 => 'Huyện Cao Phong',
                        2 => '36000',
                    ],
                336 => [
                        0 => '2014',
                        1 => 'Huyện Tân Lạc',
                        2 => '36000',
                    ],
                337 => [
                        0 => '2163',
                        1 => 'Huyện Mai Châu',
                        2 => '36000',
                    ],
                338 => [
                        0 => '2156',
                        1 => 'Huyện Lạc Sơn',
                        2 => '36000',
                    ],
                339 => [
                        0 => '2270',
                        1 => 'Huyện Yên Thủy',
                        2 => '36000',
                    ],
                340 => [
                        0 => '2157',
                        1 => 'Huyện Lạc Thủy',
                        2 => '36000',
                    ],
                341 => [
                        0 => '1680',
                        1 => 'Thành phố Hưng Yên',
                        2 => '17000',
                    ],
                342 => [
                        0 => '2046',
                        1 => 'Huyện Văn Lâm',
                        2 => '17000',
                    ],
                343 => [
                        0 => '2045',
                        1 => 'Huyện Văn Giang',
                        2 => '17000',
                    ],
                344 => [
                        0 => '1828',
                        1 => 'Huyện Yên Mỹ',
                        2 => '17000',
                    ],
                345 => [
                        0 => '1827',
                        1 => 'Thị xã Mỹ Hào',
                        2 => '17000',
                    ],
                346 => [
                        0 => '1825',
                        1 => 'Huyện Ân Thi',
                        2 => '17000',
                    ],
                347 => [
                        0 => '1826',
                        1 => 'Huyện Khoái Châu',
                        2 => '17000',
                    ],
                348 => [
                        0 => '1717',
                        1 => 'Huyện Kim Động',
                        2 => '17000',
                    ],
                349 => [
                        0 => '2018',
                        1 => 'Huyện Tiên Lữ',
                        2 => '17000',
                    ],
                350 => [
                        0 => '2194',
                        1 => 'Huyện Phù Cừ',
                        2 => '17000',
                    ],
                351 => [
                        0 => '1548',
                        1 => 'Thành phố Nha Trang',
                        2 => '57000',
                    ],
                352 => [
                        0 => '1664',
                        1 => 'Thành phố Cam Ranh',
                        2 => '57000',
                    ],
                353 => [
                        0 => '1902',
                        1 => 'Huyện Cam Lâm',
                        2 => '57000',
                    ],
                354 => [
                        0 => '1829',
                        1 => 'Huyện Vạn Ninh',
                        2 => '57000',
                    ],
                355 => [
                        0 => '2061',
                        1 => 'Thị xã Ninh Hòa',
                        2 => '57000',
                    ],
                356 => [
                        0 => '3213',
                        1 => 'Huyện Khánh Vĩnh',
                        2 => '57000',
                    ],
                357 => [
                        0 => '1739',
                        1 => 'Huyện Diên Khánh',
                        2 => '57000',
                    ],
                358 => [
                        0 => '3212',
                        1 => 'Huyện Khánh Sơn',
                        2 => '57000',
                    ],
                359 => [
                        0 => '2117',
                        1 => 'Huyện Trường Sa',
                        2 => '57000',
                    ],
                360 => [
                        0 => '1570',
                        1 => 'Thành phố Rạch Giá',
                        2 => '91000',
                    ],
                361 => [
                        0 => '2058',
                        1 => 'Thành phố Hà Tiên',
                        2 => '91000',
                    ],
                362 => [
                        0 => '1950',
                        1 => 'Huyện Kiên Lương',
                        2 => '91000',
                    ],
                363 => [
                        0 => '1830',
                        1 => 'Huyện Hòn Đất',
                        2 => '91000',
                    ],
                364 => [
                        0 => '1831',
                        1 => 'Huyện Tân Hiệp',
                        2 => '91000',
                    ],
                365 => [
                        0 => '1719',
                        1 => 'Huyện Châu Thành',
                        2 => '91000',
                    ],
                366 => [
                        0 => '1832',
                        1 => 'Huyện Giồng Riềng',
                        2 => '91000',
                    ],
                367 => [
                        0 => '2132',
                        1 => 'Huyện Gò Quao',
                        2 => '91000',
                    ],
                368 => [
                        0 => '1833',
                        1 => 'Huyện An Biên',
                        2 => '91000',
                    ],
                369 => [
                        0 => '3125',
                        1 => 'Huyện An Minh',
                        2 => '91000',
                    ],
                370 => [
                        0 => '2260',
                        1 => 'Huyện Vĩnh Thuận',
                        2 => '91000',
                    ],
                371 => [
                        0 => '2115',
                        1 => 'Thành phố Phú Quốc',
                        2 => '91000',
                    ],
                372 => [
                        0 => '2113',
                        1 => 'Huyện Kiên Hải',
                        2 => '91000',
                    ],
                373 => [
                        0 => '2251',
                        1 => 'Huyện U Minh Thượng',
                        2 => '91000',
                    ],
                374 => [
                        0 => '2134',
                        1 => 'Huyện Giang Thành',
                        2 => '91000',
                    ],
                375 => [
                        0 => '1660',
                        1 => 'Thành phố Kon Tum',
                        2 => '60000',
                    ],
                376 => [
                        0 => '1921',
                        1 => 'Huyện Đắk Glei',
                        2 => '60000',
                    ],
                377 => [
                        0 => '2187',
                        1 => 'Huyện Ngọc Hồi',
                        2 => '60000',
                    ],
                378 => [
                        0 => '2121',
                        1 => 'Huyện Đắk Tô',
                        2 => '60000',
                    ],
                379 => [
                        0 => '1834',
                        1 => 'Huyện Kon Plông',
                        2 => '60000',
                    ],
                380 => [
                        0 => '2148',
                        1 => 'Huyện Kon Rẫy',
                        2 => '60000',
                    ],
                381 => [
                        0 => '1835',
                        1 => 'Huyện Đắk Hà',
                        2 => '60000',
                    ],
                382 => [
                        0 => '2205',
                        1 => 'Huyện Sa Thầy',
                        2 => '60000',
                    ],
                383 => [
                        0 => '2225',
                        1 => 'Huyện Tu Mơ Rông',
                        2 => '60000',
                    ],
                384 => [
                        0 => '3446',
                        1 => 'Huyện Ia H\' Drai',
                        2 => '60000',
                    ],
                385 => [
                        0 => '1675',
                        1 => 'Thành phố Lai Châu',
                        2 => '30000',
                    ],
                386 => [
                        0 => '2010',
                        1 => 'Huyện Tam Đường',
                        2 => '30000',
                    ],
                387 => [
                        0 => '1980',
                        1 => 'Huyện Mường Tè',
                        2 => '30000',
                    ],
                388 => [
                        0 => '2006',
                        1 => 'Huyện Sìn Hồ',
                        2 => '30000',
                    ],
                389 => [
                        0 => '1989',
                        1 => 'Huyện Phong Thổ',
                        2 => '30000',
                    ],
                390 => [
                        0 => '2025',
                        1 => 'Huyện Than Uyên',
                        2 => '30000',
                    ],
                391 => [
                        0 => '2017',
                        1 => 'Huyện Tân Uyên',
                        2 => '30000',
                    ],
                392 => [
                        0 => '1984',
                        1 => 'Huyện Nậm Nhùn',
                        2 => '30000',
                    ],
                393 => [
                        0 => '1550',
                        1 => 'Thành phố Đà Lạt',
                        2 => '66000',
                    ],
                394 => [
                        0 => '1838',
                        1 => 'Thành phố Bảo Lộc',
                        2 => '66000',
                    ],
                395 => [
                        0 => '1919',
                        1 => 'Huyện Đam Rông',
                        2 => '66000',
                    ],
                396 => [
                        0 => '1956',
                        1 => 'Huyện Lạc Dương',
                        2 => '66000',
                    ],
                397 => [
                        0 => '1958',
                        1 => 'Huyện Lâm Hà',
                        2 => '66000',
                    ],
                398 => [
                        0 => '1836',
                        1 => 'Huyện Đơn Dương',
                        2 => '66000',
                    ],
                399 => [
                        0 => '1837',
                        1 => 'Huyện Đức Trọng',
                        2 => '66000',
                    ],
                400 => [
                        0 => '3160',
                        1 => 'Huyện Di Linh',
                        2 => '66000',
                    ],
                401 => [
                        0 => '1839',
                        1 => 'Huyện Bảo Lâm',
                        2 => '66000',
                    ],
                402 => [
                        0 => '2104',
                        1 => 'Huyện Đạ Huoai',
                        2 => '66000',
                    ],
                403 => [
                        0 => '2106',
                        1 => 'Huyện Đạ Tẻh',
                        2 => '66000',
                    ],
                404 => [
                        0 => '3146',
                        1 => 'Huyện Cát Tiên',
                        2 => '66000',
                    ],
                405 => [
                        0 => '1642',
                        1 => 'Thành phố Lạng Sơn',
                        2 => '25000',
                    ],
                406 => [
                        0 => '2036',
                        1 => 'Huyện Tràng Định',
                        2 => '25000',
                    ],
                407 => [
                        0 => '3138',
                        1 => 'Huyện Bình Gia',
                        2 => '25000',
                    ],
                408 => [
                        0 => '3310',
                        1 => 'Huyện Văn Lãng',
                        2 => '25000',
                    ],
                409 => [
                        0 => '1904',
                        1 => 'Huyện Cao Lộc',
                        2 => '25000',
                    ],
                410 => [
                        0 => '3311',
                        1 => 'Huyện Văn Quan',
                        2 => '25000',
                    ],
                411 => [
                        0 => '3134',
                        1 => 'Huyện Bắc Sơn',
                        2 => '25000',
                    ],
                412 => [
                        0 => '1948',
                        1 => 'Huyện Hữu Lũng',
                        2 => '25000',
                    ],
                413 => [
                        0 => '3156',
                        1 => 'Huyện Chi Lăng',
                        2 => '25000',
                    ],
                414 => [
                        0 => '1963',
                        1 => 'Huyện Lộc Bình',
                        2 => '25000',
                    ],
                415 => [
                        0 => '3182',
                        1 => 'Huyện Đình Lập',
                        2 => '25000',
                    ],
                416 => [
                        0 => '1682',
                        1 => 'Thành phố Lào Cai',
                        2 => '31000',
                    ],
                417 => [
                        0 => '1744',
                        1 => 'Huyện Bát Xát',
                        2 => '31000',
                    ],
                418 => [
                        0 => '2171',
                        1 => 'Huyện Mường Khương',
                        2 => '31000',
                    ],
                419 => [
                        0 => '2264',
                        1 => 'Huyện Si Ma Cai',
                        2 => '31000',
                    ],
                420 => [
                        0 => '1892',
                        1 => 'Huyện Bắc Hà',
                        2 => '31000',
                    ],
                421 => [
                        0 => '2073',
                        1 => 'Huyện Bảo Thắng',
                        2 => '31000',
                    ],
                422 => [
                        0 => '1891',
                        1 => 'Huyện Bảo Yên',
                        2 => '31000',
                    ],
                423 => [
                        0 => '2005',
                        1 => 'Thị xã Sa Pa',
                        2 => '31000',
                    ],
                424 => [
                        0 => '2043',
                        1 => 'Huyện Văn Bàn',
                        2 => '31000',
                    ],
                425 => [
                        0 => '1554',
                        1 => 'Thành phố Tân An',
                        2 => '82000',
                    ],
                426 => [
                        0 => '3329',
                        1 => 'Thị xã Kiến Tường',
                        2 => '82000',
                    ],
                427 => [
                        0 => '3273',
                        1 => 'Huyện Tân Hưng',
                        2 => '82000',
                    ],
                428 => [
                        0 => '3315',
                        1 => 'Huyện Vĩnh Hưng',
                        2 => '82000',
                    ],
                429 => [
                        0 => '3227',
                        1 => 'Huyện Mộc Hóa',
                        2 => '82000',
                    ],
                430 => [
                        0 => '3276',
                        1 => 'Huyện Tân Thạnh',
                        2 => '82000',
                    ],
                431 => [
                        0 => '3293',
                        1 => 'Huyện Thạnh Hóa',
                        2 => '82000',
                    ],
                432 => [
                        0 => '2129',
                        1 => 'Huyện Đức Huệ',
                        2 => '82000',
                    ],
                433 => [
                        0 => '1929',
                        1 => 'Huyện Đức Hòa',
                        2 => '82000',
                    ],
                434 => [
                        0 => '1894',
                        1 => 'Huyện Bến Lức',
                        2 => '82000',
                    ],
                435 => [
                        0 => '2031',
                        1 => 'Huyện Thủ Thừa',
                        2 => '82000',
                    ],
                436 => [
                        0 => '2016',
                        1 => 'Huyện Tân Trụ',
                        2 => '82000',
                    ],
                437 => [
                        0 => '1906',
                        1 => 'Huyện Cần Đước',
                        2 => '82000',
                    ],
                438 => [
                        0 => '1907',
                        1 => 'Huyện Cần Giuộc',
                        2 => '82000',
                    ],
                439 => [
                        0 => '1909',
                        1 => 'Huyện Châu Thành',
                        2 => '82000',
                    ],
                440 => [
                        0 => '1613',
                        1 => 'Thành phố Nam Định',
                        2 => '7000',
                    ],
                441 => [
                        0 => '1981',
                        1 => 'Huyện Mỹ Lộc',
                        2 => '7000',
                    ],
                442 => [
                        0 => '3319',
                        1 => 'Huyện Vụ Bản',
                        2 => '7000',
                    ],
                443 => [
                        0 => '1841',
                        1 => 'Huyện Ý Yên',
                        2 => '7000',
                    ],
                444 => [
                        0 => '3243',
                        1 => 'Huyện Nghĩa Hưng',
                        2 => '7000',
                    ],
                445 => [
                        0 => '1983',
                        1 => 'Huyện Nam Trực',
                        2 => '7000',
                    ],
                446 => [
                        0 => '3308',
                        1 => 'Huyện Trực Ninh',
                        2 => '7000',
                    ],
                447 => [
                        0 => '3323',
                        1 => 'Huyện Xuân Trường',
                        2 => '7000',
                    ],
                448 => [
                        0 => '3193',
                        1 => 'Huyện Giao Thủy',
                        2 => '7000',
                    ],
                449 => [
                        0 => '1840',
                        1 => 'Huyện Hải Hậu',
                        2 => '7000',
                    ],
                450 => [
                        0 => '1617',
                        1 => 'Thành phố Vinh',
                        2 => '43000',
                    ],
                451 => [
                        0 => '1842',
                        1 => 'Thị xã Cửa Lò',
                        2 => '43000',
                    ],
                452 => [
                        0 => '1850',
                        1 => 'Thị xã Thái Hòa',
                        2 => '43000',
                    ],
                453 => [
                        0 => '3260',
                        1 => 'Huyện Quế Phong',
                        2 => '43000',
                    ],
                454 => [
                        0 => '3261',
                        1 => 'Huyện Quỳ Châu',
                        2 => '43000',
                    ],
                455 => [
                        0 => '3211',
                        1 => 'Huyện Kỳ Sơn',
                        2 => '43000',
                    ],
                456 => [
                        0 => '3288',
                        1 => 'Huyện Tương Dương',
                        2 => '43000',
                    ],
                457 => [
                        0 => '1851',
                        1 => 'Huyện Nghĩa Đàn',
                        2 => '43000',
                    ],
                458 => [
                        0 => '1852',
                        1 => 'Huyện Quỳ Hợp',
                        2 => '43000',
                    ],
                459 => [
                        0 => '1848',
                        1 => 'Huyện Quỳnh Lưu',
                        2 => '43000',
                    ],
                460 => [
                        0 => '1853',
                        1 => 'Huyện Con Cuông',
                        2 => '43000',
                    ],
                461 => [
                        0 => '1845',
                        1 => 'Huyện Tân Kỳ',
                        2 => '43000',
                    ],
                462 => [
                        0 => '1844',
                        1 => 'Huyện Anh Sơn',
                        2 => '43000',
                    ],
                463 => [
                        0 => '1847',
                        1 => 'Huyện Diễn Châu',
                        2 => '43000',
                    ],
                464 => [
                        0 => '1846',
                        1 => 'Huyện Yên Thành',
                        2 => '43000',
                    ],
                465 => [
                        0 => '1843',
                        1 => 'Huyện Đô Lương',
                        2 => '43000',
                    ],
                466 => [
                        0 => '3291',
                        1 => 'Huyện Thanh Chương',
                        2 => '43000',
                    ],
                467 => [
                        0 => '1854',
                        1 => 'Huyện Nghi Lộc',
                        2 => '43000',
                    ],
                468 => [
                        0 => '3233',
                        1 => 'Huyện Nam Đàn',
                        2 => '43000',
                    ],
                469 => [
                        0 => '1947',
                        1 => 'Huyện Hưng Nguyên',
                        2 => '43000',
                    ],
                470 => [
                        0 => '1849',
                        1 => 'Thị xã Hoàng Mai',
                        2 => '43000',
                    ],
                471 => [
                        0 => '1615',
                        1 => 'Thành phố Ninh Bình',
                        2 => '8000',
                    ],
                472 => [
                        0 => '1713',
                        1 => 'Thành phố Tam Điệp',
                        2 => '8000',
                    ],
                473 => [
                        0 => '3247',
                        1 => 'Huyện Nho Quan',
                        2 => '8000',
                    ],
                474 => [
                        0 => '3191',
                        1 => 'Huyện Gia Viễn',
                        2 => '8000',
                    ],
                475 => [
                        0 => '1944',
                        1 => 'Huyện Hoa Lư',
                        2 => '8000',
                    ],
                476 => [
                        0 => '1714',
                        1 => 'Huyện Yên Khánh',
                        2 => '8000',
                    ],
                477 => [
                        0 => '3205',
                        1 => 'Huyện Kim Sơn',
                        2 => '8000',
                    ],
                478 => [
                        0 => '3327',
                        1 => 'Huyện Yên Mô',
                        2 => '8000',
                    ],
                479 => [
                        0 => '1665',
                        1 => 'Thành phố Phan Rang',
                        2 => '59000',
                    ],
                480 => [
                        0 => '3129',
                        1 => 'Huyện Bác Ái',
                        2 => '59000',
                    ],
                481 => [
                        0 => '1855',
                        1 => 'Huyện Ninh Sơn',
                        2 => '59000',
                    ],
                482 => [
                        0 => '1985',
                        1 => 'Huyện Ninh Hải',
                        2 => '59000',
                    ],
                483 => [
                        0 => '1986',
                        1 => 'Huyện Ninh Phước',
                        2 => '59000',
                    ],
                484 => [
                        0 => '3301',
                        1 => 'Huyện Thuận Bắc',
                        2 => '59000',
                    ],
                485 => [
                        0 => '3302',
                        1 => 'Huyện Thuận Nam',
                        2 => '59000',
                    ],
                486 => [
                        0 => '1602',
                        1 => 'Thành phố Việt Trì',
                        2 => '35000',
                    ],
                487 => [
                        0 => '2064',
                        1 => 'Thị xã Phú Thọ',
                        2 => '35000',
                    ],
                488 => [
                        0 => '1925',
                        1 => 'Huyện Đoan Hùng',
                        2 => '35000',
                    ],
                489 => [
                        0 => '1938',
                        1 => 'Huyện Hạ Hòa',
                        2 => '35000',
                    ],
                490 => [
                        0 => '3290',
                        1 => 'Huyện Thanh Ba',
                        2 => '35000',
                    ],
                491 => [
                        0 => '1994',
                        1 => 'Huyện Phù Ninh',
                        2 => '35000',
                    ],
                492 => [
                        0 => '2268',
                        1 => 'Huyện Yên Lập',
                        2 => '35000',
                    ],
                493 => [
                        0 => '1905',
                        1 => 'Huyện Cẩm Khê',
                        2 => '35000',
                    ],
                494 => [
                        0 => '3272',
                        1 => 'Huyện Tam Nông',
                        2 => '35000',
                    ],
                495 => [
                        0 => '1959',
                        1 => 'Huyện Lâm Thao',
                        2 => '35000',
                    ],
                496 => [
                        0 => '2029',
                        1 => 'Huyện Thanh Sơn',
                        2 => '35000',
                    ],
                497 => [
                        0 => '2237',
                        1 => 'Huyện Thanh Thủy',
                        2 => '35000',
                    ],
                498 => [
                        0 => '2015',
                        1 => 'Huyện Tân Sơn',
                        2 => '35000',
                    ],
                499 => [
                        0 => '1663',
                        1 => 'Thành phố Tuy Hòa',
                        2 => '56000',
                    ],
                500 => [
                        0 => '1856',
                        1 => 'Thị Xã Sông Cầu',
                        2 => '56000',
                    ],
                501 => [
                        0 => '3186',
                        1 => 'Huyện Đồng Xuân',
                        2 => '56000',
                    ],
                502 => [
                        0 => '3284',
                        1 => 'Huyện Tuy An',
                        2 => '56000',
                    ],
                503 => [
                        0 => '2211',
                        1 => 'Huyện Sơn Hòa',
                        2 => '56000',
                    ],
                504 => [
                        0 => '2206',
                        1 => 'Huyện Sông Hinh',
                        2 => '56000',
                    ],
                505 => [
                        0 => '3278',
                        1 => 'Huyện Tây Hòa',
                        2 => '56000',
                    ],
                506 => [
                        0 => '1993',
                        1 => 'Huyện Phú Hòa',
                        2 => '56000',
                    ],
                507 => [
                        0 => '3184',
                        1 => 'Thị xã Đông Hòa',
                        2 => '56000',
                    ],
                508 => [
                        0 => '1619',
                        1 => 'Thành phố Đồng Hới',
                        2 => '47000',
                    ],
                509 => [
                        0 => '3224',
                        1 => 'Huyện Minh Hóa',
                        2 => '47000',
                    ],
                510 => [
                        0 => '3286',
                        1 => 'Huyện Tuyên Hóa',
                        2 => '47000',
                    ],
                511 => [
                        0 => '3258',
                        1 => 'Huyện Quảng Trạch',
                        2 => '47000',
                    ],
                512 => [
                        0 => '1858',
                        1 => 'Huyện Bố Trạch',
                        2 => '47000',
                    ],
                513 => [
                        0 => '2002',
                        1 => 'Huyện Quảng Ninh',
                        2 => '47000',
                    ],
                514 => [
                        0 => '1857',
                        1 => 'Huyện Lệ Thủy',
                        2 => '47000',
                    ],
                515 => [
                        0 => '1859',
                        1 => 'Thị xã Ba Đồn',
                        2 => '47000',
                    ],
                516 => [
                        0 => '1631',
                        1 => 'Thành phố Tam Kỳ',
                        2 => '51000',
                    ],
                517 => [
                        0 => '1632',
                        1 => 'Thành phố Hội An',
                        2 => '51000',
                    ],
                518 => [
                        0 => '2219',
                        1 => 'Huyện Tây Giang',
                        2 => '51000',
                    ],
                519 => [
                        0 => '2125',
                        1 => 'Huyện Đông Giang',
                        2 => '51000',
                    ],
                520 => [
                        0 => '1917',
                        1 => 'Huyện Đại Lộc',
                        2 => '51000',
                    ],
                521 => [
                        0 => '1736',
                        1 => 'Thị xã Điện Bàn',
                        2 => '51000',
                    ],
                522 => [
                        0 => '1735',
                        1 => 'Huyện Duy Xuyên',
                        2 => '51000',
                    ],
                523 => [
                        0 => '2003',
                        1 => 'Huyện Quế Sơn',
                        2 => '51000',
                    ],
                524 => [
                        0 => '2177',
                        1 => 'Huyện Nam Giang',
                        2 => '51000',
                    ],
                525 => [
                        0 => '2198',
                        1 => 'Huyện Phước Sơn',
                        2 => '51000',
                    ],
                526 => [
                        0 => '2139',
                        1 => 'Huyện Hiệp Đức',
                        2 => '51000',
                    ],
                527 => [
                        0 => '2239',
                        1 => 'Huyện Thăng Bình',
                        2 => '51000',
                    ],
                528 => [
                        0 => '2224',
                        1 => 'Huyện Tiên Phước',
                        2 => '51000',
                    ],
                529 => [
                        0 => '2078',
                        1 => 'Huyện Bắc Trà My',
                        2 => '51000',
                    ],
                530 => [
                        0 => '2178',
                        1 => 'Huyện Nam Trà My',
                        2 => '51000',
                    ],
                531 => [
                        0 => '1987',
                        1 => 'Huyện Núi Thành',
                        2 => '51000',
                    ],
                532 => [
                        0 => '1995',
                        1 => 'Huyện Phú Ninh',
                        2 => '51000',
                    ],
                533 => [
                        0 => '2182',
                        1 => 'Huyện Nông Sơn',
                        2 => '51000',
                    ],
                534 => [
                        0 => '1630',
                        1 => 'Thành phố Quảng Ngãi',
                        2 => '53000',
                    ],
                535 => [
                        0 => '1898',
                        1 => 'Huyện Bình Sơn',
                        2 => '53000',
                    ],
                536 => [
                        0 => '3304',
                        1 => 'Huyện Trà Bồng',
                        2 => '53000',
                    ],
                537 => [
                        0 => '2222',
                        1 => 'Huyện Tây Trà',
                        2 => '53000',
                    ],
                538 => [
                        0 => '1737',
                        1 => 'Huyện Sơn Tịnh',
                        2 => '53000',
                    ],
                539 => [
                        0 => '1738',
                        1 => 'Huyện Tư Nghĩa',
                        2 => '53000',
                    ],
                540 => [
                        0 => '2210',
                        1 => 'Huyện Sơn Hà',
                        2 => '53000',
                    ],
                541 => [
                        0 => '3270',
                        1 => 'Huyện Sơn Tây',
                        2 => '53000',
                    ],
                542 => [
                        0 => '2167',
                        1 => 'Huyện Minh Long',
                        2 => '53000',
                    ],
                543 => [
                        0 => '1988',
                        1 => 'Huyện Nghĩa Hành',
                        2 => '53000',
                    ],
                544 => [
                        0 => '3226',
                        1 => 'Huyện Mộ Đức',
                        2 => '53000',
                    ],
                545 => [
                        0 => '1930',
                        1 => 'Thị xã Đức Phổ',
                        2 => '53000',
                    ],
                546 => [
                        0 => '3127',
                        1 => 'Huyện Ba Tơ',
                        2 => '53000',
                    ],
                547 => [
                        0 => '2114',
                        1 => 'Huyện Lý Sơn',
                        2 => '53000',
                    ],
                548 => [
                        0 => '1604',
                        1 => 'Thành phố Hạ Long',
                        2 => '1000',
                    ],
                549 => [
                        0 => '1603',
                        1 => 'Thành phố Móng Cái',
                        2 => '1000',
                    ],
                550 => [
                        0 => '1683',
                        1 => 'Thành phố Cẩm Phả',
                        2 => '1000',
                    ],
                551 => [
                        0 => '1686',
                        1 => 'Thành phố Uông Bí',
                        2 => '1000',
                    ],
                552 => [
                        0 => '1896',
                        1 => 'Huyện Bình Liêu',
                        2 => '1000',
                    ],
                553 => [
                        0 => '2019',
                        1 => 'Huyện Tiên Yên',
                        2 => '1000',
                    ],
                554 => [
                        0 => '3180',
                        1 => 'Huyện Đầm Hà',
                        2 => '1000',
                    ],
                555 => [
                        0 => '1940',
                        1 => 'Huyện Hải Hà',
                        2 => '1000',
                    ],
                556 => [
                        0 => '3126',
                        1 => 'Huyện Ba Chẽ',
                        2 => '1000',
                    ],
                557 => [
                        0 => '1920',
                        1 => 'Huyện Vân Đồn',
                        2 => '1000',
                    ],
                558 => [
                        0 => '3199',
                        1 => 'Huyện Hoành Bồ',
                        2 => '1000',
                    ],
                559 => [
                        0 => '3185',
                        1 => 'Thị xã Đông Triều',
                        2 => '1000',
                    ],
                560 => [
                        0 => '2066',
                        1 => 'Thị xã Quảng Yên',
                        2 => '1000',
                    ],
                561 => [
                        0 => '2109',
                        1 => 'Huyện Cô Tô',
                        2 => '1000',
                    ],
                562 => [
                        0 => '1620',
                        1 => 'Thành phố Đông Hà',
                        2 => '48000',
                    ],
                563 => [
                        0 => '1621',
                        1 => 'Thị xã Quảng Trị',
                        2 => '48000',
                    ],
                564 => [
                        0 => '1861',
                        1 => 'Huyện Vĩnh Linh',
                        2 => '48000',
                    ],
                565 => [
                        0 => '1860',
                        1 => 'Huyện Hướng Hóa',
                        2 => '48000',
                    ],
                566 => [
                        0 => '1936',
                        1 => 'Huyện Gio Linh',
                        2 => '48000',
                    ],
                567 => [
                        0 => '2105',
                        1 => 'Huyện Đa Krông',
                        2 => '48000',
                    ],
                568 => [
                        0 => '1903',
                        1 => 'Huyện Cam Lộ',
                        2 => '48000',
                    ],
                569 => [
                        0 => '2040',
                        1 => 'Huyện Triệu Phong',
                        2 => '48000',
                    ],
                570 => [
                        0 => '2137',
                        1 => 'Huyện Hải Lăng',
                        2 => '48000',
                    ],
                571 => [
                        0 => '1568',
                        1 => 'Thành phố Sóc Trăng',
                        2 => '96000',
                    ],
                572 => [
                        0 => '1910',
                        1 => 'Huyện Châu Thành',
                        2 => '96000',
                    ],
                573 => [
                        0 => '1949',
                        1 => 'Huyện Kế Sách',
                        2 => '96000',
                    ],
                574 => [
                        0 => '2173',
                        1 => 'Huyện Mỹ Tú',
                        2 => '96000',
                    ],
                575 => [
                        0 => '2093',
                        1 => 'Huyện Cù Lao Dung',
                        2 => '96000',
                    ],
                576 => [
                        0 => '2161',
                        1 => 'Huyện Long Phú',
                        2 => '96000',
                    ],
                577 => [
                        0 => '1743',
                        1 => 'Huyện Mỹ Xuyên',
                        2 => '96000',
                    ],
                578 => [
                        0 => '2062',
                        1 => 'Thị xã Ngã Năm',
                        2 => '96000',
                    ],
                579 => [
                        0 => '2238',
                        1 => 'Huyện Thạnh Trị',
                        2 => '96000',
                    ],
                580 => [
                        0 => '2272',
                        1 => 'Thị xã Vĩnh Châu',
                        2 => '96000',
                    ],
                581 => [
                        0 => '2037',
                        1 => 'Huyện Trần Đề',
                        2 => '96000',
                    ],
                582 => [
                        0 => '1677',
                        1 => 'Thành phố Sơn La',
                        2 => '34000',
                    ],
                583 => [
                        0 => '2204',
                        1 => 'Huyện Quỳnh Nhai',
                        2 => '34000',
                    ],
                584 => [
                        0 => '2032',
                        1 => 'Huyện Thuận Châu',
                        2 => '34000',
                    ],
                585 => [
                        0 => '3230',
                        1 => 'Huyện Mường La',
                        2 => '34000',
                    ],
                586 => [
                        0 => '2079',
                        1 => 'Huyện Bắc Yên',
                        2 => '34000',
                    ],
                587 => [
                        0 => '1996',
                        1 => 'Huyện Phù Yên',
                        2 => '34000',
                    ],
                588 => [
                        0 => '1976',
                        1 => 'Huyện Mộc Châu',
                        2 => '34000',
                    ],
                589 => [
                        0 => '2267',
                        1 => 'Huyện Yên Châu',
                        2 => '34000',
                    ],
                590 => [
                        0 => '1971',
                        1 => 'Huyện Mai Sơn',
                        2 => '34000',
                    ],
                591 => [
                        0 => '2007',
                        1 => 'Huyện Sông Mã',
                        2 => '34000',
                    ],
                592 => [
                        0 => '3266',
                        1 => 'huyện Sốp Cộp',
                        2 => '34000',
                    ],
                593 => [
                        0 => '2255',
                        1 => 'Huyện Vân Hồ',
                        2 => '34000',
                    ],
                594 => [
                        0 => '1626',
                        1 => 'Thành phố Tây Ninh',
                        2 => '80000',
                    ],
                595 => [
                        0 => '1862',
                        1 => 'Huyện Tân Biên',
                        2 => '80000',
                    ],
                596 => [
                        0 => '1863',
                        1 => 'Huyện Tân Châu',
                        2 => '80000',
                    ],
                597 => [
                        0 => '1864',
                        1 => 'Huyện Dương Minh Châu',
                        2 => '80000',
                    ],
                598 => [
                        0 => '1720',
                        1 => 'Huyện Châu Thành',
                        2 => '80000',
                    ],
                599 => [
                        0 => '1721',
                        1 => 'Thị xã Hòa Thành',
                        2 => '80000',
                    ],
                600 => [
                        0 => '1866',
                        1 => 'Huyện Gò Dầu',
                        2 => '80000',
                    ],
                601 => [
                        0 => '1865',
                        1 => 'Huyện Bến Cầu',
                        2 => '80000',
                    ],
                602 => [
                        0 => '2035',
                        1 => 'Thị xã Trảng Bàng',
                        2 => '80000',
                    ],
                603 => [
                        0 => '1599',
                        1 => 'Thành phố Thái Bình',
                        2 => '6000',
                    ],
                604 => [
                        0 => '1868',
                        1 => 'Huyện Quỳnh Phụ',
                        2 => '6000',
                    ],
                605 => [
                        0 => '1867',
                        1 => 'Huyện Hưng Hà',
                        2 => '6000',
                    ],
                606 => [
                        0 => '1715',
                        1 => 'Huyện Đông Hưng',
                        2 => '6000',
                    ],
                607 => [
                        0 => '1869',
                        1 => 'Huyện Thái Thụy',
                        2 => '6000',
                    ],
                608 => [
                        0 => '3281',
                        1 => 'Huyện Tiền Hải',
                        2 => '6000',
                    ],
                609 => [
                        0 => '1951',
                        1 => 'Huyện Kiến Xương',
                        2 => '6000',
                    ],
                610 => [
                        0 => '1716',
                        1 => 'Huyện Vũ Thư',
                        2 => '6000',
                    ],
                611 => [
                        0 => '1639',
                        1 => 'Thành phố Thái Nguyên',
                        2 => '24000',
                    ],
                612 => [
                        0 => '1684',
                        1 => 'Thành Phố Sông Công',
                        2 => '24000',
                    ],
                613 => [
                        0 => '1924',
                        1 => 'Huyện Định Hóa',
                        2 => '24000',
                    ],
                614 => [
                        0 => '2195',
                        1 => 'Huyện Phú Lương',
                        2 => '24000',
                    ],
                615 => [
                        0 => '1731',
                        1 => 'Huyện Đồng Hỷ',
                        2 => '24000',
                    ],
                616 => [
                        0 => '2051',
                        1 => 'Huyện Võ Nhai',
                        2 => '24000',
                    ],
                617 => [
                        0 => '1918',
                        1 => 'Huyện Đại Từ',
                        2 => '24000',
                    ],
                618 => [
                        0 => '1990',
                        1 => 'Thị xã Phổ Yên',
                        2 => '24000',
                    ],
                619 => [
                        0 => '1991',
                        1 => 'Huyện Phú Bình',
                        2 => '24000',
                    ],
                620 => [
                        0 => '1616',
                        1 => 'Thành phố Thanh Hóa',
                        2 => '40000',
                    ],
                621 => [
                        0 => '1876',
                        1 => 'Thị xã Bỉm Sơn',
                        2 => '40000',
                    ],
                622 => [
                        0 => '1712',
                        1 => 'Thành phố Sầm Sơn',
                        2 => '40000',
                    ],
                623 => [
                        0 => '1878',
                        1 => 'Huyện Mường Lát',
                        2 => '40000',
                    ],
                624 => [
                        0 => '1879',
                        1 => 'Huyện Quan Hóa',
                        2 => '40000',
                    ],
                625 => [
                        0 => '2070',
                        1 => 'Huyện Bá Thước',
                        2 => '40000',
                    ],
                626 => [
                        0 => '2000',
                        1 => 'Huyện Quan Sơn',
                        2 => '40000',
                    ],
                627 => [
                        0 => '3216',
                        1 => 'Huyện Lang Chánh',
                        2 => '40000',
                    ],
                628 => [
                        0 => '1874',
                        1 => 'Huyện Ngọc Lặc',
                        2 => '40000',
                    ],
                629 => [
                        0 => '3147',
                        1 => 'Huyện Cẩm Thủy',
                        2 => '40000',
                    ],
                630 => [
                        0 => '1880',
                        1 => 'Huyện Thạch Thành',
                        2 => '40000',
                    ],
                631 => [
                        0 => '1877',
                        1 => 'Huyện Hà Trung',
                        2 => '40000',
                    ],
                632 => [
                        0 => '1881',
                        1 => 'Huyện Vĩnh Lộc',
                        2 => '40000',
                    ],
                633 => [
                        0 => '1875',
                        1 => 'Huyện Yên Định',
                        2 => '40000',
                    ],
                634 => [
                        0 => '1873',
                        1 => 'Huyện Thọ Xuân',
                        2 => '40000',
                    ],
                635 => [
                        0 => '1872',
                        1 => 'Huyện Thường Xuân',
                        2 => '40000',
                    ],
                636 => [
                        0 => '2249',
                        1 => 'Huyện Triệu Sơn',
                        2 => '40000',
                    ],
                637 => [
                        0 => '3298',
                        1 => 'Huyện Thiệu Hóa',
                        2 => '40000',
                    ],
                638 => [
                        0 => '1748',
                        1 => 'Huyện Hoằng Hóa',
                        2 => '40000',
                    ],
                639 => [
                        0 => '1942',
                        1 => 'Huyện Hậu Lộc',
                        2 => '40000',
                    ],
                640 => [
                        0 => '3241',
                        1 => 'Huyện Nga Sơn',
                        2 => '40000',
                    ],
                641 => [
                        0 => '1871',
                        1 => 'Huyện Như Xuân',
                        2 => '40000',
                    ],
                642 => [
                        0 => '2190',
                        1 => 'Huyện Như Thanh',
                        2 => '40000',
                    ],
                643 => [
                        0 => '2181',
                        1 => 'Huyện Nông Cống',
                        2 => '40000',
                    ],
                644 => [
                        0 => '1927',
                        1 => 'Huyện Đông Sơn',
                        2 => '40000',
                    ],
                645 => [
                        0 => '1747',
                        1 => 'Huyện Quảng Xương',
                        2 => '40000',
                    ],
                646 => [
                        0 => '1870',
                        1 => 'Thị Xã Nghi Sơn',
                        2 => '40000',
                    ],
                647 => [
                        0 => '1585',
                        1 => 'Thành phố Huế',
                        2 => '49000',
                    ],
                648 => [
                        0 => '2193',
                        1 => 'Huyện Phong Điền',
                        2 => '49000',
                    ],
                649 => [
                        0 => '3257',
                        1 => 'Huyện Quảng Điền',
                        2 => '49000',
                    ],
                650 => [
                        0 => '1749',
                        1 => 'Huyện Phú Vang',
                        2 => '49000',
                    ],
                651 => [
                        0 => '1698',
                        1 => 'Thị xã Hương Thủy',
                        2 => '49000',
                    ],
                652 => [
                        0 => '1697',
                        1 => 'Thị xã Hương Trà',
                        2 => '49000',
                    ],
                653 => [
                        0 => '1885',
                        1 => 'Huyện A Lưới',
                        2 => '49000',
                    ],
                654 => [
                        0 => '1882',
                        1 => 'Huyện Phú Lộc',
                        2 => '49000',
                    ],
                655 => [
                        0 => '3234',
                        1 => 'Huyện Nam Đông',
                        2 => '49000',
                    ],
                656 => [
                        0 => '1556',
                        1 => 'Thành phố Mỹ Tho',
                        2 => '84000',
                    ],
                657 => [
                        0 => '2057',
                        1 => 'Thị xã Gò Công',
                        2 => '84000',
                    ],
                658 => [
                        0 => '2055',
                        1 => 'Thị xã Cai Lậy',
                        2 => '84000',
                    ],
                659 => [
                        0 => '3275',
                        1 => 'Huyện Tân Phước',
                        2 => '84000',
                    ],
                660 => [
                        0 => '1900',
                        1 => 'Huyện Cái Bè',
                        2 => '84000',
                    ],
                661 => [
                        0 => '2084',
                        1 => 'Huyện Cai Lậy',
                        2 => '84000',
                    ],
                662 => [
                        0 => '1740',
                        1 => 'Huyện Châu Thành',
                        2 => '84000',
                    ],
                663 => [
                        0 => '1741',
                        1 => 'Huyện Chợ Gạo',
                        2 => '84000',
                    ],
                664 => [
                        0 => '1933',
                        1 => 'Huyện Gò Công Tây',
                        2 => '84000',
                    ],
                665 => [
                        0 => '1932',
                        1 => 'Huyện Gò Công Đông',
                        2 => '84000',
                    ],
                666 => [
                        0 => '2216',
                        1 => 'Huyện Tân Phú Đông',
                        2 => '84000',
                    ],
                667 => [
                        0 => '1560',
                        1 => 'Thành phố Trà Vinh',
                        2 => '87000',
                    ],
                668 => [
                        0 => '2086',
                        1 => 'Huyện Càng Long',
                        2 => '87000',
                    ],
                669 => [
                        0 => '2091',
                        1 => 'Huyện Cầu Kè',
                        2 => '87000',
                    ],
                670 => [
                        0 => '2020',
                        1 => 'Huyện Tiểu Cần',
                        2 => '87000',
                    ],
                671 => [
                        0 => '1911',
                        1 => 'Huyện Châu Thành',
                        2 => '87000',
                    ],
                672 => [
                        0 => '1908',
                        1 => 'Huyện Cầu Ngang',
                        2 => '87000',
                    ],
                673 => [
                        0 => '2033',
                        1 => 'Huyện Trà Cú',
                        2 => '87000',
                    ],
                674 => [
                        0 => '2103',
                        1 => 'Huyện Duyên Hải',
                        2 => '87000',
                    ],
                675 => [
                        0 => '3443',
                        1 => 'Thị xã Duyên Hải',
                        2 => '87000',
                    ],
                676 => [
                        0 => '1601',
                        1 => 'Thành phố Tuyên Quang',
                        2 => '22000',
                    ],
                677 => [
                        0 => '1957',
                        1 => 'Huyện Lâm Bình',
                        2 => '22000',
                    ],
                678 => [
                        0 => '1982',
                        1 => 'Huyện Na Hang',
                        2 => '22000',
                    ],
                679 => [
                        0 => '3157',
                        1 => 'Huyện Chiêm Hóa',
                        2 => '22000',
                    ],
                680 => [
                        0 => '1941',
                        1 => 'Huyện Hàm Yên',
                        2 => '22000',
                    ],
                681 => [
                        0 => '1745',
                        1 => 'Huyện Yên Sơn',
                        2 => '22000',
                    ],
                682 => [
                        0 => '3267',
                        1 => 'Huyện Sơn Dương',
                        2 => '22000',
                    ],
                683 => [
                        0 => '1562',
                        1 => 'Thành phố Vĩnh Long',
                        2 => '85000',
                    ],
                684 => [
                        0 => '1962',
                        1 => 'Huyện Long Hồ',
                        2 => '85000',
                    ],
                685 => [
                        0 => '2164',
                        1 => 'Huyện Mang Thít',
                        2 => '85000',
                    ],
                686 => [
                        0 => '2263',
                        1 => 'Huyện Vũng Liêm',
                        2 => '85000',
                    ],
                687 => [
                        0 => '2008',
                        1 => 'Huyện Tam Bình',
                        2 => '85000',
                    ],
                688 => [
                        0 => '2054',
                        1 => 'Thị xã Bình Minh',
                        2 => '85000',
                    ],
                689 => [
                        0 => '2034',
                        1 => 'Huyện Trà Ôn',
                        2 => '85000',
                    ],
                690 => [
                        0 => '2081',
                        1 => 'Huyện Bình Tân',
                        2 => '85000',
                    ],
                691 => [
                        0 => '1578',
                        1 => 'Thành phố Vĩnh Yên',
                        2 => '15000',
                    ],
                692 => [
                        0 => '2065',
                        1 => 'Thành phố Phúc Yên',
                        2 => '15000',
                    ],
                693 => [
                        0 => '1960',
                        1 => 'Huyện Lập Thạch',
                        2 => '15000',
                    ],
                694 => [
                        0 => '2009',
                        1 => 'Huyện Tam Dương',
                        2 => '15000',
                    ],
                695 => [
                        0 => '3271',
                        1 => 'Huyện Tam Đảo',
                        2 => '15000',
                    ],
                696 => [
                        0 => '1732',
                        1 => 'Huyện Bình Xuyên',
                        2 => '15000',
                    ],
                697 => [
                        0 => '1734',
                        1 => 'Huyện Yên Lạc',
                        2 => '15000',
                    ],
                698 => [
                        0 => '1733',
                        1 => 'Huyện Vĩnh Tường',
                        2 => '15000',
                    ],
                699 => [
                        0 => '3265',
                        1 => 'Huyện Sông Lô',
                        2 => '15000',
                    ],
                700 => [
                        0 => '1674',
                        1 => 'Thành phố Yên Bái',
                        2 => '33000',
                    ],
                701 => [
                        0 => '2063',
                        1 => 'Thị xã Nghĩa Lộ',
                        2 => '33000',
                    ],
                702 => [
                        0 => '1967',
                        1 => 'Huyện Lục Yên',
                        2 => '33000',
                    ],
                703 => [
                        0 => '2047',
                        1 => 'Huyện Văn Yên',
                        2 => '33000',
                    ],
                704 => [
                        0 => '1977',
                        1 => 'Huyện Mù Cang Chải',
                        2 => '33000',
                    ],
                705 => [
                        0 => '2039',
                        1 => 'Huyện Trấn Yên',
                        2 => '33000',
                    ],
                706 => [
                        0 => '2248',
                        1 => 'Huyện Trạm Tấu',
                        2 => '33000',
                    ],
                707 => [
                        0 => '2044',
                        1 => 'Huyện Văn Chấn',
                        2 => '33000',
                    ],
                708 => [
                        0 => '2266',
                        1 => 'Huyện Yên Bình',
                        2 => '33000',
                    ],
                709 => [
                        0 => '1580',
                        1 => 'Quận Đặc Biệt',
                        2 => '70000',
                    ],
                710 => [
                        0 => '3448',
                        1 => 'Quận Đặc Biệt DC',
                        2 => '70000',
                    ],
                711 => [
                        0 => '3442',
                        1 => 'Quận Đặc Biệt',
                        2 => '10000',
                    ],
                712 => [
                        0 => '3447',
                        1 => 'Quận Đặc Biệt',
                        2 => '50000',
                    ],
                713 => [
                        0 => '2111',
                        1 => 'Huyện Côn Đảo',
                        2 => '78000',
                    ],
                714 => [
                        0 => '2112',
                        1 => 'Huyện Hoàng Sa',
                        2 => '50000',
                    ],
                715 => [
                        0 => '3694',
                        1 => 'Huyện Quảng Hòa',
                        2 => '21000',
                    ],
                716 => [
                        0 => '3695',
                        1 => 'Thành Phố Thủ Đức',
                        2 => '70000',
                    ],
                717 => [
                        0 => '2107',
                        1 => 'Huyện Bạch Long Vĩ',
                        2 => '4000',
                    ],
                718 => [
                        0 => '2110',
                        1 => 'Huyện Cồn Cỏ',
                        2 => '48000',
                    ],
            ];
    }
}
